docs/tutorials/building-programs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-28 Mon 10:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tutorial: Building Programs</title>
<meta name="author" content="Connor Redfern" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../modulus-style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Tutorial: Building Programs</h1>
<div style="text-align:right">
<p>
<a href="../index.html">Modulus</a> / <a href="index.html">Tutorials</a> / Building Programs
</p>
</div>

<div id="outline-container-org46355ae" class="outline-2">
<h2 id="org46355ae">Programs, Modules and Main</h2>
<div class="outline-text-2" id="text-org46355ae">
<p>
In the previous tutorial, <a href="expressions.html">expressions</a>, we made use of the REPL to evaluate
expressions like <code>2 + 2</code> and <code>3 + 4</code>. However, most code we write is part of a
program - code which is in a file somewhere and which, when executed, should do
something (e.g. browse the web, run a game, etc.). 
</p>

<p>
However, the tutorial so far has only covered how to calculate things things -
but if our program when run does a big calculation then stops, we won't have any
way of knowing what results it got! A program needs some way of taking input
from the world, and outputting results into the world. This is IO. 
</p>
</div>


<div id="outline-container-org915fa21" class="outline-3">
<h3 id="org915fa21">A First Program</h3>
<div class="outline-text-3" id="text-org915fa21">
<p>
Let's write a first program: the venerable Hello World. Modulus programs are
arranged into files called modules. So, to start, create a file called
<code>main.mls</code> and put the line <code>(module main)</code> at the top. For the moment, this
line won't do much, but we can add to it later. Next, we need to tell modulus
what it should <i>do</i> when the program is done. To do this, modulus looks for a
value called <code>main</code> which tells it what to do when the program is run. For now,
we just want to say hi, so write <code>(def main (put-line "Hello, World!"))</code>.
However, we don't have access to <code>put-line</code>, which is in a separate module
(<code>sys.console</code>). So, just above your <code>def main</code>, write <code>(open sys.console)</code>.
When you're done, the file should look like this:
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span><span style="color: #738FD7;">module</span> main<span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span><span style="color: #738FD7;">open</span> sys.console<span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span><span style="color: #738FD7;">def</span> main <span style="color: #9d81ba;">(</span>put-line <span style="color: #7CF083;">"Hello, World!"</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>

<p>
To get this program to run, ⟨TODO: tooling⟩.
</p>
</div>
</div>
</div>


<div id="outline-container-org5e0c2c1" class="outline-2">
<h2 id="org5e0c2c1">Actions and The IO Type</h2>
<div class="outline-text-2" id="text-org5e0c2c1">
<p>
So, we're now outputting `Hello, World!', but how does it work?. IO in Modulus
is based around the concept of an <b>action</b>. Unlike a function, which simply
calculates, an action represents an interaction with the outside world. Actions
which perform IO have type <code>IO A</code>, where A is the value an action outputs. For
example, the inverse of <code>put-line</code>, <code>get-line</code> has type <code>IO String</code>. This means
it does some IO (reads user input) and returns a String. <code>put-line</code>, meanwhile,
has a rather odd type: <code>String → IO Unit</code>. In other words, it is a <i>function</i>,
which takes a string as input, then returns an <i>action</i> which has return type
<code>Unit</code>. This makes some degree of sense: <code>put-line "hello"</code> represents the
<i>action</i> which outputs "hello", so what's with the <code>Unit</code> return type? <code>Unit</code> is
somewhat like <code>Bool</code>. If you see a <code>Bool</code>, it could be two values: <code>true</code> or
<code>false</code>. By contrast, if you see a <code>Unit</code>, it can be only one value, which is
written <code>()</code>. This makes sense: if you know an action returns Unit, then you
know it <i>must</i> return the value <code>()</code>, and so the result is uninteresting - it
contains no information.
</p>


<p>
That's a lot of writing without much code, but I promise we'll get there soon.
So far, I've discussed singular actions: <code>print-line "hello"</code> or
<code>get-line</code>. What we need is a mechanism for <i>combining</i> actions together into
larger actions, to say things like: "First print 'hello, world' then make a
beeping sound", or "Repeatedly read in lines from the console until the user
types 'exit'". Fortunately, we only really need three functions to do this:
<code>seq</code>, <code>bind</code> and <code>pure</code>.
</p>
</div>

<div id="outline-container-orgeeaa0d1" class="outline-3">
<h3 id="orgeeaa0d1">Sequencing</h3>
<div class="outline-text-3" id="text-orgeeaa0d1">
<p>
The first function in our list is <code>seq</code>. Seq represents the idea of "do x and
then do y". For example, we can first output "hello, world" then "goodbye,
world" with the code:
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span><span style="color: #738FD7;">module</span> main<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">open</span> sys.console<span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span><span style="color: #738FD7;">def</span> main
  <span style="color: #9d81ba;">(</span>seq <span style="color: #4d9391;">(</span>put-line <span style="color: #7CF083;">"hello, world"</span><span style="color: #4d9391;">)</span>
       <span style="color: #4d9391;">(</span>put-line <span style="color: #7CF083;">"goodbye, world!"</span><span style="color: #4d9391;">)</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>

<p>
If you want to sequence more than two actions, then <code>seq</code> can be nested as follows:
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span><span style="color: #738FD7;">module</span> main<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">open</span> sys.console<span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span><span style="color: #738FD7;">def</span> main
  <span style="color: #9d81ba;">(</span>seq <span style="color: #4d9391;">(</span>put-line <span style="color: #7CF083;">"hello, world"</span><span style="color: #4d9391;">)</span>
       <span style="color: #4d9391;">(</span>seq <span style="color: #a0586c;">(</span>put-line <span style="color: #7CF083;">"dum dee doo"</span><span style="color: #a0586c;">)</span>
            <span style="color: #a0586c;">(</span>put-line <span style="color: #7CF083;">"goodbye, world!"</span><span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>

<p>
This can get somewhat awkward (with many parentheses!) if you want to sequence
multiple actions, so <code>&gt;&gt;</code> is offered as an infix alternative. 
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span><span style="color: #738FD7;">module</span> main<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">open</span> sys.console<span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span><span style="color: #738FD7;">def</span> main
  <span style="color: #9d81ba;">(</span>put-line <span style="color: #7CF083;">"hello, world"</span> &gt;&gt; <span style="color: #7CF083;">"dum dee doo"</span> &gt;&gt; put-line <span style="color: #7CF083;">"goodbye, world!"</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgffec75d" class="outline-3">
<h3 id="orgffec75d">Bind</h3>
<div class="outline-text-3" id="text-orgffec75d">
<p>
Seq works for "do x then y", but we can't use it to express the idea "first do x
then use the results in y". For this we need <code>bind</code>. As an example program,
imagine we want to greet our user: first, we get their name, then we say hi:
</p>

<div class="org-src-container">
<pre class="src src-perl">Bob         <span style="color: #545c5e;"># user input</span>
Hello, Bob! <span style="color: #545c5e;"># program output</span>
</pre>
</div>

<p>
A naive attempt to write this program (one without <code>bind</code>) might look something
like:
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span><span style="color: #738FD7;">module</span> main<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">open</span> sys.console<span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span>greet : String &#8594; IO String<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">defn</span> greet <span style="color: #9d81ba;">[</span>name<span style="color: #9d81ba;">]</span>
  <span style="color: #9d81ba;">(</span>put-line <span style="color: #4d9391;">(</span><span style="color: #7CF083;">"hello, "</span> &#8901; name &#8901; <span style="color: #7CF083;">"!"</span><span style="color: #4d9391;">)</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span><span style="color: #738FD7;">def</span> main
  <span style="color: #9d81ba;">(</span>greet get-line<span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>

<p>
However, this code will not compile: it would return a type error. This is
because the "greet" function expects a <code>String</code> argument, but we're giving it an
<code>IO String</code>. Oops! 
</p>

<p>
In order to "correctly" write this function, we make a simple adjustment:  
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span><span style="color: #738FD7;">module</span> main<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">open</span> sys.console<span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span>greet : String &#8594; IO String<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">defn</span> greet <span style="color: #9d81ba;">[</span>name<span style="color: #9d81ba;">]</span>
  <span style="color: #9d81ba;">(</span>put-line <span style="color: #4d9391;">(</span><span style="color: #7CF083;">"hello, "</span> &#8901; name &#8901; <span style="color: #7CF083;">"!"</span><span style="color: #4d9391;">)</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span><span style="color: #738FD7;">def</span> main
  <span style="color: #9d81ba;">(</span>bind put-line greet<span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>

<p>
As with <code>seq</code>, it has an infix version, <code>&gt;&gt;=</code>, which lets you write:
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span><span style="color: #738FD7;">module</span> main<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">open</span> sys.console<span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span>greet : String &#8594; IO String<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">defn</span> greet <span style="color: #9d81ba;">[</span>name<span style="color: #9d81ba;">]</span>
  <span style="color: #9d81ba;">(</span>put-line <span style="color: #4d9391;">(</span><span style="color: #7CF083;">"hello, "</span> &#8901; name &#8901; <span style="color: #7CF083;">"!"</span><span style="color: #4d9391;">)</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span><span style="color: #738FD7;">def</span> main <span style="color: #9d81ba;">(</span>put-line &gt;&gt;= greet<span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd16078" class="outline-3">
<h3 id="orgcd16078">Do Notation</h3>
<div class="outline-text-3" id="text-orgcd16078">
<p>
Before moving to the final function, <code>pure</code>, I'll introduce a handy bit of
notation: <code>do</code> notation. To demonstrate why it's useful, let's first build a
relatively simple function: it will read in two lines, then combine them
together.
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span><span style="color: #738FD7;">def</span> main 
  <span style="color: #9d81ba;">(</span>get-line &gt;&gt;=
    <span style="color: #4d9391;">(</span><span style="color: #738FD7;">&#955;</span> <span style="color: #a0586c;">[</span>line1<span style="color: #a0586c;">]</span> <span style="color: #a0586c;">(</span>get-line &gt;&gt;=
      <span style="color: #53859d;">(</span><span style="color: #738FD7;">&#955;</span> <span style="color: #5D8272;">[</span>line2<span style="color: #5D8272;">]</span> <span style="color: #5D8272;">(</span>put-line <span style="color: #cd9575;">(</span>line1 &#8901; line2<span style="color: #cd9575;">)</span><span style="color: #5D8272;">)</span><span style="color: #53859d;">)</span><span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>

<p>
This function is somewhat difficult to read, and <code>bind</code> will only get more
unwieldy as we add more steps. With <code>do</code> notation, we can re-write this:
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span><span style="color: #738FD7;">def</span> main
  <span style="color: #9d81ba;">(</span><span style="color: #738FD7;">do</span> <span style="color: #4d9391;">(</span>line1 &#8592; get-line<span style="color: #4d9391;">)</span>
      <span style="color: #4d9391;">(</span>line2 &#8592; get-line<span style="color: #4d9391;">)</span>
      <span style="color: #4d9391;">(</span>put-line <span style="color: #a0586c;">(</span>line1 &#8901; line2<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org628e4b5" class="outline-3">
<h3 id="org628e4b5">Pure</h3>
</div>
</div>


<div id="outline-container-org5716042" class="outline-2">
<h2 id="org5716042">Useful Functions</h2>
<div class="outline-text-2" id="text-org5716042">
<ul class="org-ul">
<li>Unless</li>

<li>Until</li>

<li>Join</li>
</ul>
</div>
</div>
</div>
</body>
</html>
